# Data Preparation

The different procedures for data preparation:
- loading
- assembling 
    - merging
    - concatenating
    - combining
- reshaping (pivoting)
- removing

Loading includes conversion from different formats into a data structure such as DataFrame.

Assembling phase in differennt ways:
- Merging-pandas.merge(): connects the rows in a DataFrame based on one or more keys.
- Concatenating-pandas.concat(): concatenates the object along an axis
- Combining-pandas.DataFrame.combine_first(): method to allow us connect overlapped data in order to fill missing values in a data structure by taking data from another structure.

## Merging

- JOIN<->SQL
- using one or more keys

In [2]:
import numpy as np
import pandas as pd

In [21]:
frame1 = pd.DataFrame({'id':['ball','pencil','pen','mug','ashtray'],
                      'price': [12.33,11.44,33.21,13.23,33.62]})
frame2 = pd.DataFrame({'id':['pencil','pencil','ball','pen'],
                      'color': ['white','red','red','black']})

In [22]:
frame1

        id  price
0     ball  12.33
1   pencil  11.44
2      pen  33.21
3      mug  13.23
4  ashtray  33.62

In [23]:
frame2

       id  color
0  pencil  white
1  pencil    red
2    ball    red
3     pen  black

In [24]:
pd.merge(frame1, frame2, how='inner') # intersection

       id  price  color
0    ball  12.33    red
1  pencil  11.44  white
2  pencil  11.44    red
3     pen  33.21  black

In [25]:
pd.merge(frame1, frame2, how='outer') # union

        id  price  color
0     ball  12.33    red
1   pencil  11.44  white
2   pencil  11.44    red
3      pen  33.21  black
4      mug  13.23    NaN
5  ashtray  33.62    NaN

In [29]:
frame1 = pd.DataFrame( {'id':['ball','pencil','pen','mug','ashtray'],
                        'color': ['white','red','red','black','green'],
                        'brand': ['OMG','ABC','ABC','POD','POD']})
frame2 = pd.DataFrame( {'id':['pencil','pencil','ball','pen'],
                        'brand': ['OMG','POD','ABC','POD']})

In [30]:
frame1

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD

In [31]:
frame2

       id brand
0  pencil   OMG
1  pencil   POD
2    ball   ABC
3     pen   POD

In [32]:
pd.merge(frame1, frame2) # if we have more than one column with same values
# have to specify what colum the merge is on

Empty DataFrame
Columns: [id, color, brand]
Index: []

In [33]:
pd.merge(frame1, frame2, on='id')

       id  color brand_x brand_y
0    ball  white     OMG     ABC
1  pencil    red     ABC     OMG
2  pencil    red     ABC     POD
3     pen    red     ABC     POD

In [34]:
pd.merge(frame1, frame2, on='id', how='outer')

        id  color brand_x brand_y
0     ball  white     OMG     ABC
1   pencil    red     ABC     OMG
2   pencil    red     ABC     POD
3      pen    red     ABC     POD
4      mug  black     POD     NaN
5  ashtray  green     POD     NaN

In [5]:
pd.merge(frame1, frame2, on='brand')

      id_x  color brand    id_y
0     ball  white   OMG  pencil
1   pencil    red   ABC    ball
2      pen    red   ABC    ball
3      mug  black   POD  pencil
4      mug  black   POD     pen
5  ashtray  green   POD  pencil
6  ashtray  green   POD     pen

Often, however, the opposite problem arises, that is, to have two DataFrames in which the key columns do not have the same name. To remedy this situation, you have to use the left_on and right_on options that specify the key column for the first and for the second DataFrame. Now you can see an example.

In [13]:
frame2.columns = ['sid', 'brand']

In [14]:
frame2

      sid brand
0  pencil   OMG
1  pencil   POD
2    ball   ABC
3     pen   POD

In [15]:
frame1

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD

In [18]:
pd.merge(frame1, frame2, left_on='id', right_on='sid')

       id  color brand_x     sid brand_y
0    ball  white     OMG    ball     ABC
1  pencil    red     ABC  pencil     OMG
2  pencil    red     ABC  pencil     POD
3     pen    red     ABC     pen     POD

In [19]:
pd.merge(frame1, frame2, left_on='id', right_on='sid', how='outer')

        id  color brand_x     sid brand_y
0     ball  white     OMG    ball     ABC
1   pencil    red     ABC  pencil     OMG
2   pencil    red     ABC  pencil     POD
3      pen    red     ABC     pen     POD
4      mug  black     POD     NaN     NaN
5  ashtray  green     POD     NaN     NaN

In [35]:
frame2.columns = ['id', 'brand']

In [36]:
frame1

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD

In [37]:
frame2

       id brand
0  pencil   OMG
1  pencil   POD
2    ball   ABC
3     pen   POD

In [38]:
pd.merge(frame1, frame2, on='id', how='left')

        id  color brand_x brand_y
0     ball  white     OMG     ABC
1   pencil    red     ABC     OMG
2   pencil    red     ABC     POD
3      pen    red     ABC     POD
4      mug  black     POD     NaN
5  ashtray  green     POD     NaN

In [39]:
pd.merge(frame1, frame2, on='id', how='right')

       id  color brand_x brand_y
0    ball  white     OMG     ABC
1  pencil    red     ABC     OMG
2  pencil    red     ABC     POD
3     pen    red     ABC     POD

In [43]:
# we can merge based on multiple keys
pd.merge(frame1, frame2, on=['id', 'brand'], how='outer')

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD
5   pencil    NaN   OMG
6   pencil    NaN   POD
7     ball    NaN   ABC
8      pen    NaN   POD

## Merging on Index

Index as key

In [44]:
pd.merge(frame1, frame2, right_index=True, left_index=True)

     id_x  color brand_x    id_y brand_y
0    ball  white     OMG  pencil     OMG
1  pencil    red     ABC  pencil     POD
2     pen    red     ABC    ball     ABC
3     mug  black     POD     pen     POD

But the DataFrame objects have a join() function which is much more convenient when you want to do the __merging by indexes__. It can also be used to combine many DataFrame objects having the same or the same indexes but with __columns not overlapping__.

In [45]:
frame2.columns = ['id2', 'brand2']

In [46]:
frame1

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD

In [47]:
frame2

      id2 brand2
0  pencil    OMG
1  pencil    POD
2    ball    ABC
3     pen    POD

In [48]:
frame1.join(frame2) # based on index rather than key column

        id  color brand     id2 brand2
0     ball  white   OMG  pencil    OMG
1   pencil    red   ABC  pencil    POD
2      pen    red   ABC    ball    ABC
3      mug  black   POD     pen    POD
4  ashtray  green   POD     NaN    NaN

---

## Concatenating

In [49]:
array1 = np.random.randint(100, 200, (3, 3))
array2 = np.random.randint(100, 200, (3, 3))

In [51]:
np.concatenate([array1, array2])

array([[149, 126, 133],
       [136, 153, 184],
       [112, 193, 109],
       [194, 130, 110],
       [100, 117, 182],
       [182, 120, 147]])

In [52]:
np.concatenate([array1, array2], axis=1)

array([[149, 126, 133, 194, 130, 110],
       [136, 153, 184, 100, 117, 182],
       [112, 193, 109, 182, 120, 147]])

In [53]:
ser1 = pd.Series(np.random.randint(100, 200, 4), index=range(1, 5))
ser2 = pd.Series(np.random.randint(100, 200, 4), index=range(5, 9))

In [54]:
ser1

1    169
2    197
3    123
4    166
dtype: int32

In [55]:
ser2

5    108
6    180
7    110
8    180
dtype: int32

In [58]:
pd.concat([ser1, ser2])

1    169
2    197
3    123
4    166
5    108
6    180
7    110
8    180
dtype: int32

In [59]:
pd.concat([ser1, ser2], axis=1) # preserves index!

       0      1
1  169.0    NaN
2  197.0    NaN
3  123.0    NaN
4  166.0    NaN
5    NaN  108.0
6    NaN  180.0
7    NaN  110.0
8    NaN  180.0

In [60]:
ser1 = pd.Series(np.random.randint(100, 200, 4))
ser2 = pd.Series(np.random.randint(100, 200, 4))

In [61]:
ser1

0    171
1    140
2    138
3    146
dtype: int32

In [62]:
ser2

0    180
1    115
2    117
3    139
dtype: int32

In [63]:
pd.concat([ser1, ser2])

0    171
1    140
2    138
3    146
0    180
1    115
2    117
3    139
dtype: int32

In [64]:
pd.concat([ser1, ser2], axis=1)

     0    1
0  171  180
1  140  115
2  138  117
3  146  139

In [65]:
ser1 = pd.Series(np.random.randint(100, 200, 4), index=range(1, 5))
ser2 = pd.Series(np.random.randint(100, 200, 4), index=range(5, 9))

In [67]:
pd.concat([ser1, ser2], axis=1, join='outer')

       0      1
1  165.0    NaN
2  152.0    NaN
3  173.0    NaN
4  184.0    NaN
5    NaN  107.0
6    NaN  156.0
7    NaN  197.0
8    NaN  166.0

In [68]:
pd.concat([ser1, ser2], keys=[1, 2]) 
# keys will become label level one of hierarchical indexing

1  1    165
   2    152
   3    173
   4    184
2  5    107
   6    156
   7    197
   8    166
dtype: int32

In [69]:
pd.concat([ser1, ser2], keys=['one', 'two'])

one  1    165
     2    152
     3    173
     4    184
two  5    107
     6    156
     7    197
     8    166
dtype: int32

In [70]:
ser1 = pd.Series(np.random.randint(100, 200, 4))
ser2 = pd.Series(np.random.randint(100, 200, 4))

In [71]:
pd.concat([ser1, ser2], keys=['one', 'two'])

one  0    106
     1    115
     2    145
     3    107
two  0    186
     1    178
     2    141
     3    100
dtype: int32

In [72]:
ser1 = pd.Series(np.random.randint(100, 200, 4), index=range(1, 5))
ser2 = pd.Series(np.random.randint(100, 200, 4), index=range(5, 9))

In [73]:
pd.concat([ser1, ser2], axis=1, keys=['col1','col2']) 
# keys will become column labels

    col1   col2
1  152.0    NaN
2  108.0    NaN
3  162.0    NaN
4  139.0    NaN
5    NaN  140.0
6    NaN  150.0
7    NaN  157.0
8    NaN  194.0

In [74]:
frame1 = pd.DataFrame(np.random.randint(100, 200, (3, 3)),
                     index=[1, 2, 3],
                     columns=list('ABC'))
frame2 = pd.DataFrame(np.random.randint(100, 200, (3, 3)),
                     index=[4, 5, 6],
                     columns=list('ABC'))

In [75]:
frame1

     A    B    C
1  119  197  115
2  124  149  168
3  172  176  118

In [76]:
frame2

     A    B    C
4  123  143  190
5  151  165  133
6  135  194  145

In [77]:
pd.concat([frame1, frame2])

     A    B    C
1  119  197  115
2  124  149  168
3  172  176  118
4  123  143  190
5  151  165  133
6  135  194  145

In [78]:
pd.concat([frame1, frame2], axis=1)

       A      B      C      A      B      C
1  119.0  197.0  115.0    NaN    NaN    NaN
2  124.0  149.0  168.0    NaN    NaN    NaN
3  172.0  176.0  118.0    NaN    NaN    NaN
4    NaN    NaN    NaN  123.0  143.0  190.0
5    NaN    NaN    NaN  151.0  165.0  133.0
6    NaN    NaN    NaN  135.0  194.0  145.0

---

## Combining

There is another situation in which there is combination of data that cannot be obtained either with merging or with concatenation. Take the case in which you want the two datasets to have indexes that __overlap__ in their entirety or at least partially. One applicable function to Series is combine_first(), which performs this kind of operation along with an data alignment. __Only for Series!!__

In [79]:
ser1 = pd.Series(np.random.randint(100, 200, 5),
                index=range(1, 6))
ser2 = pd.Series(np.random.randint(100, 200, 4),
                index=[2, 4, 5, 6])

In [80]:
ser1

1    143
2    143
3    133
4    136
5    183
dtype: int32

In [81]:
ser2

2    101
4    123
5    138
6    151
dtype: int32

In [82]:
ser1.combine_first(ser2)

1    143.0
2    143.0
3    133.0
4    136.0
5    183.0
6    151.0
dtype: float64

In [83]:
ser2.combine_first(ser1)

1    143.0
2    101.0
3    133.0
4    123.0
5    138.0
6    151.0
dtype: float64

In [84]:
ser1[:3].combine_first(ser2[:3]) # just overlap first three data
# take first 3 from ser1 and the rest is on ser2

1    143.0
2    143.0
3    133.0
4    123.0
5    138.0
dtype: float64

---

# Pivoting

In addition to assembling the data in order to unify the values collected from different sources, another fairly common operation is pivoting. In fact, arrangement of the values by row or by column is not always suited to your goals. Sometimes you would like to rearrange the data carrying column values on rows or vice versa.

You have already seen that DataFrame can support hierarchical indexing. This feature can be exploited to
rearrange the data in a DataFrame. In the context of pivoting you have two basic operations:
- stacking: rotates or pivots the data structure converting columns to rows
- unstacking: converts rows into columns

In [85]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
                    index=['white','black','red'],
                    columns=['ball','pen','pencil'])

In [86]:
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [88]:
frame1.stack()

white  ball      0
       pen       1
       pencil    2
black  ball      3
       pen       4
       pencil    5
red    ball      6
       pen       7
       pencil    8
dtype: int32

In [90]:
ser = frame1.stack()

In [91]:
ser

white  ball      0
       pen       1
       pencil    2
black  ball      3
       pen       4
       pencil    5
red    ball      6
       pen       7
       pencil    8
dtype: int32

In [92]:
ser.unstack()

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [93]:
ser.unstack(0) # parameter for level

        white  black  red
ball        0      3    6
pen         1      4    7
pencil      2      5    8

## Pivoting from "Long" to "Wide" Format

The most common way to store data sets is produced by the punctual registration of data that will fill a line of
the text file, for example, CSV, or a table of a database. This happens especially when you have instrumental
readings, calculation results iterated over time, or the simple manual input of a series of values. A similar
case of these files is for example the logs file, which is filled line by line by accumulating data in it.


The peculiar characteristic of this type of data set is to have entries on various columns, often
duplicated in subsequent lines. Always remaining in tabular format of data, when you are in such cases you
can refer them to as long or stacked format.

In [94]:
longframe = pd.DataFrame({ 'color':['white','white','white',
                            'red','red','red',
                            'black','black','black'],
                            'item':['ball','pen','mug',
                            'ball','pen','mug',
                            'ball','pen','mug'],
                            'value': np.random.rand(9)})

In [95]:
longframe

   color  item     value
0  white  ball  0.253125
1  white   pen  0.341055
2  white   mug  0.363834
3    red  ball  0.371348
4    red   pen  0.710595
5    red   mug  0.591842
6  black  ball  0.833185
7  black   pen  0.086288
8  black   mug  0.100842

Disadvantages of long or unstacked format:
- multiplycity and repetition
- difficult to read

Instead of the long format, there is another way to arrange the data in a table that is called wide. This mode is easier to read, allowing easy connection with other tables, and it occupies much less space. So in general it is a more efficient way of storing the data, although less practical, especially if during the filling of the data.

As a criterion, select a column, or a set of them, as the __primary key__; then, the values contained in it __must
be unique__.

In [96]:
wideframe = longframe.pivot('color', 'item')

In [97]:
wideframe

          value
item       ball       mug       pen
color
black  0.833185  0.100842  0.086288
red    0.371348  0.591842  0.710595
white  0.253125  0.363834  0.341055

In [98]:
wideframe.stack()

               value
color item
black ball  0.833185
      mug   0.100842
      pen   0.086288
red   ball  0.371348
      mug   0.591842
      pen   0.710595
white ball  0.253125
      mug   0.363834
      pen   0.341055

In [99]:
wideframe.T.stack()

       item  color
value  ball  black    0.833185
             red      0.371348
             white    0.253125
       mug   black    0.100842
             red      0.591842
             white    0.363834
       pen   black    0.086288
             red      0.710595
             white    0.341055
dtype: float64

In [103]:
wideframe.T.stack()['value']

item  color
ball  black    0.833185
      red      0.371348
      white    0.253125
mug   black    0.100842
      red      0.591842
      white    0.363834
pen   black    0.086288
      red      0.710595
      white    0.341055
dtype: float64

---

# Removing

In [106]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
                    index=['white','black','red'],
                    columns=['ball','pen','pencil'])

In [107]:
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [109]:
del frame1['ball']

In [110]:
frame1

       pen  pencil
white    1       2
black    4       5
red      7       8

In [111]:
frame1.drop('white')

       pen  pencil
black    4       5
red      7       8

In [112]:
frame1

       pen  pencil
white    1       2
black    4       5
red      7       8

---

# Important Points

- Data Preparation:
    - loading
    - assembling:
        - merging (pandas.merge): must have keys
            - parameters: how, on, left_on, right_on, right_index, left_index
            - obj1.join(obj2), merge by index
        - concatenating (pandas.concat: works like numpy concatenate
            - parameters: axis, keys
        - combining (series1.combine_first(series2): for Series, and take data from first or second
    - rearranging(pivoting): 
        - stack() to less dimensional DataFrame or Series. With hierarchical indexing
        - unstack() to DataFrame
        - pivot(): long format to wide format
            - parameters: column to level
            - values that contained must be unique
    - removing:
        - del 
        - drop:
            parameters: axis